# -*- coding: utf-8 -*-
##############################################################################
## 三竹簡訊發送平台
## 網址：https://www.mitake.com.tw
##############################################################################
import os
import sys
import requests
import urllib
##############################################################################
from . SMS import SMS
##############################################################################
class SmsMitake                  ( SMS                                     ) :
  ############################################################################
  def __init__                   ( self , Options = { }                    ) :
    ##########################################################################
    self . setOptions            (        Options                            )
    ##########################################################################
    return
  ############################################################################
  def __del__                    ( self                                    ) :
    return
  ############################################################################
  def setOptions                 ( self , Options                          ) :
    ##########################################################################
    self . URL      = Options    [ "Hostname"                                ]
    self . Username = Options    [ "Username"                                ]
    self . Password = Options    [ "Password"                                ]
    self . Credits  = 0
    self . Error    = ""
    ##########################################################################
    return
  ############################################################################
  def ParseHttpLine                  ( self , LINE , JSON                  ) :
    ##########################################################################
    L            = LINE .  strip     (                                       )
    L            = L    . rstrip     (                                       )
    ##########################################################################
    AT           = L    . find       ( "="                                   )
    if                               ( AT < 0                              ) :
      return JSON
    ##########################################################################
    KEY          = L                 [        : AT                           ]
    VALUE        = L                 [ AT + 1 :                              ]
    ##########################################################################
    JSON [ KEY ] = f"{VALUE}"
    ##########################################################################
    return JSON
  ############################################################################
  def ParseHttpResponses              ( self , response                    ) :
    ##########################################################################
    JSON       =                      {                                      }
    ##########################################################################
    LINEs      = response . split     ( "\n"                                 )
    for L in LINEs                                                           :
      JSON     = self . ParseHttpLine ( L , JSON                             )
    ##########################################################################
    return JSON
  ############################################################################
  def login                          ( self                                ) :
    return True
  ############################################################################
  def error                          ( self                                ) :
    return self . Error
  ############################################################################
  def toPhone                         ( self , phone                       ) :
    ##########################################################################
    if                                ( len ( phone ) <= 0                 ) :
      return ""
    ##########################################################################
    if                                ( "+886-" in phone                   ) :
      phone = phone . replace         ( "+886-" , "0"                        )
    ##########################################################################
    phone   = phone . replace         ( "+"     , ""                         )
    phone   = phone . replace         ( "-"     , ""                         )
    ##########################################################################
    return phone
  ############################################################################
  ## 查詢剩餘點數
  ############################################################################
  def credits                        ( self                                ) :
    ##########################################################################
    self . Credits = 0
    self . Error   = ""
    ##########################################################################
    CMD            = self . URL + "/api/mtk/SmQuery"
    Parameters     = { "username" : self . Username                          ,
                       "password" : self . Password                          }
    try                                                                      :
      answer       = requests . post ( CMD , params = Parameters             )
    except                                                                   :
      self . Error = "Failure to Query Mitake account Credits"
      return False
    ##########################################################################
    if                               ( answer . status_code != 200         ) :
      CODE         = answer . status_code
      self . Error = f"HTTP return code is {CODE}"
      return False
    ##########################################################################
    JSON           = self . ParseHttpResponses ( answer . text               )
    ##########################################################################
    if                               ( "AccountPoint" not in JSON          ) :
      self . Error = f"Mitake did not answer current credits"
      return False
    ##########################################################################
    self . Credits = int             ( JSON [ "AccountPoint" ]               )
    ##########################################################################
    return self . Credits
  ############################################################################
  ## 發送簡訊
  ############################################################################
  def send                       ( self , phone , content , title = ""     ) :
    ##########################################################################
    self . Error   = ""
    PHONENUMBER    = self . toPhone ( phone                                  )
    ##########################################################################
    if                           ( len ( PHONENUMBER ) <= 0                ) :
      self . Error = "SMS requires a valid phone number"
      return False
    ##########################################################################
    if                           ( len ( content ) <= 0                    ) :
      self . Error = "SMS requires content"
      return False
    ##########################################################################
    BODY           = content
    BODY           = BODY . replace ( "\n" , "\x06"                          )
    ##########################################################################
    CMD            = self . URL + "/api/mtk/SmSend"
    Parameters     = { "CharsetURL" : "UTF-8"                                ,
                       "username"   : self . Username                        ,
                       "password"   : self . Password                        ,
                       "dstaddr"    : PHONENUMBER                            ,
                       "smbody"     : BODY                                   }
    try                                                                      :
      answer       = requests . post ( CMD , params = Parameters             )
    except                                                                   :
      self . Error = "Failure to send SMS Content via Mitake"
      return False
    ##########################################################################
    if                               ( answer . status_code != 200         ) :
      CODE         = answer . status_code
      self . Error = f"HTTP return code is {CODE} when sending SMS Content"
      return False
    ##########################################################################
    JSON           = self . ParseHttpResponses ( answer . text               )
    ##########################################################################
    if                               ( "statuscode" not in JSON            ) :
      self . Error = f"Mitake did not answer current status code"
      return False
    ##########################################################################
    Status         = JSON            [ "statuscode"                          ]
    if ( Status not in [ "0" , "1" , "2" , "4" ] )                           :
      self . Error = Status
      return False
    ##########################################################################
    return True
##############################################################################
